app/controllers/books_controller.rb

  def index
  	@newbook = Book.new
  	@books = Book.all
---
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
    @newbook = Book.new
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def edit
    @book = Book.find(params[:id])
    @user = User.find(@book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
  	@newbook = Book.new(book_params)
    @newbook.user_id = current_user.id
   if @newbook.save
    	redirect_to book_path(@newbook.id), notice: 'You have created book successfully.'
   else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "fsadnof"], ["body", "fjdpak;ld"], ["created_at", "2019-11-18 11:13:16.426724"], ["updated_at", "2019-11-18 11:13:16.426724"], ["user_id", "16"]]
SELECT "books".* FROM "books"

  def update
    @book = Book.find(params[:id])
   if
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "ndm\r\n\r\n"], ["updated_at", "2019-11-18 11:13:36.708819"], ["id", 30]]

  def destroy
    book = Book.find(params[:id])
    book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 18]]